	.section .text
.LNDBG_TX:
# mark_description "Intel(R) C Intel(R) 64 Compiler for applications running on Intel(R) 64, Version 16.0.0.109 Build 20150815";
# mark_description "-I.. -I../pngwriter/include -qoffload -S -g -O3 -opt-gather-scatter-unroll=8 -fopenmp -fimf-domain-exclusion";
# mark_description "=8 -mkl -mavx -qopt-report=5 -qopt-report-phase=vec -qopt-report-file=stdout -opt-report-routine=simd";
	.file "gatherbound.cpp"
	.text
..TXTST0:
.L_2__routine_start_main_0:
# -- Begin  main
	.text
# mark_begin;
       .align    16,0x90
	.globl main
# --- main(int, char **)
main:
# parameter 1(argc): %edi
# parameter 2(argv): %rsi
..B1.1:                         # Preds ..B1.0
	.cfi_startproc
	.cfi_personality 0x3,__gxx_personality_v0
..___tag_value_main.2:
..L3:
                                                          #284.1
..LN0:
	.file   1 "gatherbound.cpp"
	.loc    1  284  is_stmt 1
        pushq     %rbp                                          #284.1
	.cfi_def_cfa_offset 16
..LN1:
        movq      %rsp, %rbp                                    #284.1
	.cfi_def_cfa 6, 16
	.cfi_offset 6, -16
..LN2:
        andq      $-128, %rsp                                   #284.1
..LN3:
        pushq     %r12                                          #284.1
..LN4:
        pushq     %r13                                          #284.1
..LN5:
        pushq     %r14                                          #284.1
..LN6:

//	DW_TAG_formal_parameter:
	.byte 0x1a
//	DW_AT_decl_line:
	.byte 0x25
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_type:
	.4byte 0x000000a5
//	DW_AT_name:
	.4byte .debug_str+0x199
//	DW_TAG_formal_parameter:
	.byte 0x1a
//	DW_AT_decl_line:
	.byte 0x26
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_type:
	.4byte 0x00000ac1
//	DW_AT_name:
	.4byte .debug_str+0x1a3
//	DW_TAG_formal_parameter:
	.byte 0x1a
//	DW_AT_decl_line:
	.byte 0x27
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_type:
	.4byte 0x00000af0
//	DW_AT_name:
	.4byte .debug_str+0x243
//	DW_TAG_formal_parameter:
	.byte 0x1a
//	DW_AT_decl_line:
	.byte 0x28
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_type:
	.4byte 0x00000af0
//	DW_AT_name:
	.4byte .debug_str+0x24d
//	DW_TAG_formal_parameter:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x29
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_AT_name:
	.2byte 0x004e
//	DW_TAG_formal_parameter:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x2a
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_type:
	.4byte 0x00000b20
//	DW_AT_name:
	.2byte 0x004d
//	DW_TAG_variable:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x32
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.2byte 0x0042
//	DW_AT_type:
	.4byte 0x00000af0
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0x34
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x257
//	DW_AT_type:
	.4byte 0x000000a5
//	DW_AT_location:
	.2byte 0x5e01
//	DW_TAG_inlined_subroutine:
	.byte 0x26
//	DW_AT_low_pc:
	.8byte ..LN39
//	DW_AT_high_pc:
	.8byte ..LN44
//	DW_AT_abstract_origin:
	.4byte 0x00000b48
//	DW_AT_call_line:
	.byte 0x32
//	DW_AT_call_column:
	.byte 0x17
//	DW_AT_call_file:
	.byte 0x02
//	DW_TAG_formal_parameter:
	.byte 0x27
//	DW_AT_decl_line:
	.2byte 0x0121
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00000b25
//	DW_AT_name:
	.4byte .debug_str+0x264
	.byte 0x00
//	DW_TAG_inlined_subroutine:
	.byte 0x26
//	DW_AT_low_pc:
	.8byte ..LN47
//	DW_AT_high_pc:
	.8byte ..LN52
//	DW_AT_abstract_origin:
	.4byte 0x00000b48
//	DW_AT_call_line:
	.byte 0x33
//	DW_AT_call_column:
	.byte 0x13
//	DW_AT_call_file:
	.byte 0x02
//	DW_TAG_formal_parameter:
	.byte 0x27
//	DW_AT_decl_line:
	.2byte 0x0121
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00000b25
//	DW_AT_name:
	.4byte .debug_str+0x264
	.byte 0x00
//	DW_TAG_inlined_subroutine:
	.byte 0x26
//	DW_AT_low_pc:
	.8byte ..LN55
//	DW_AT_high_pc:
	.8byte ..LN61
//	DW_AT_abstract_origin:
	.4byte 0x00000b2f
//	DW_AT_call_line:
	.byte 0x34
//	DW_AT_call_column:
	.byte 0x19
//	DW_AT_call_file:
	.byte 0x02
//	DW_TAG_formal_parameter:
	.byte 0x27
//	DW_AT_decl_line:
	.2byte 0x011c
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00000b25
//	DW_AT_name:
	.4byte .debug_str+0x264
	.byte 0x00
	.byte 0x00
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x28
//	DW_AT_type:
	.4byte 0x00000ac6
//	DW_TAG_pointer_type:
	.byte 0x28
//	DW_AT_type:
	.4byte 0x00000acb
//	DW_TAG_base_type:
	.byte 0x29
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x19e
//	DW_TAG_typedef:
	.byte 0x2a
//	DW_AT_decl_line:
	.byte 0x2c
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x1a8
//	DW_AT_type:
	.4byte 0x00000add
//	DW_TAG_base_type:
	.byte 0x29
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x1af
//	DW_TAG_pointer_type:
	.byte 0x28
//	DW_AT_type:
	.4byte 0x00000ae9
//	DW_TAG_base_type:
	.byte 0x29
//	DW_AT_byte_size:
	.byte 0x00
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x1bd
//	DW_TAG_base_type:
	.byte 0x29
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x1b8
//	DW_TAG_pointer_type:
	.byte 0x28
//	DW_AT_type:
	.4byte 0x00000afc
//	DW_TAG_base_type:
	.byte 0x29
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x1cb
//	DW_TAG_base_type:
	.byte 0x29
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x1d7
//	DW_TAG_pointer_type:
	.byte 0x28
//	DW_AT_type:
	.4byte 0x00000b0f
//	DW_TAG_subroutine_type:
	.byte 0x2b
//	DW_TAG_formal_parameter:
	.byte 0x06
//	DW_AT_type:
	.4byte 0x00000af7
//	DW_TAG_formal_parameter:
	.byte 0x06
//	DW_AT_type:
	.4byte 0x00000af0
//	DW_TAG_formal_parameter:
	.byte 0x06
//	DW_AT_type:
	.4byte 0x00000af0
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x28
//	DW_AT_type:
	.4byte 0x00000af0
//	DW_TAG_pointer_type:
	.byte 0x28
//	DW_AT_type:
	.4byte 0x00000b2a
//	DW_TAG_const_type:
	.byte 0x2c
//	DW_AT_type:
	.4byte 0x00000acb
//	DW_TAG_subprogram:
	.byte 0x2d
//	DW_AT_decl_line:
	.2byte 0x011c
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000000a5
//	DW_AT_name:
	.4byte .debug_str+0x26b
	.4byte .debug_str+0x26b
//	DW_AT_external:
	.byte 0x01
//	DW_AT_inline:
	.byte 0x03
//	DW_TAG_formal_parameter:
	.byte 0x06
//	DW_AT_type:
	.4byte 0x00000b25
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x2d
//	DW_AT_decl_line:
	.2byte 0x0121
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000af0
//	DW_AT_name:
	.4byte .debug_str+0x25f
	.4byte .debug_str+0x25f
//	DW_AT_external:
	.byte 0x01
//	DW_AT_inline:
	.byte 0x03
//	DW_TAG_formal_parameter:
	.byte 0x06
//	DW_AT_type:
	.4byte 0x00000b25
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x28
//	DW_AT_type:
	.4byte 0x00000af7
//	DW_TAG_const_type:
	.byte 0x2c
//	DW_AT_type:
	.4byte 0x00000af0
//	DW_TAG_pointer_type:
	.byte 0x28
//	DW_AT_type:
	.4byte 0x00000af7
//	DW_TAG_pointer_type:
	.byte 0x28
//	DW_AT_type:
	.4byte 0x000000a5
//	DW_TAG_pointer_type:
	.byte 0x28
//	DW_AT_type:
	.4byte 0x00000b7a
//	DW_TAG_const_type:
	.byte 0x2c
//	DW_AT_type:
	.4byte 0x00000b7f
//	DW_TAG_union_type:
	.byte 0x2e
//	DW_AT_decl_line:
	.byte 0x27
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_byte_size:
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0x3b3
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x2d
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x3bb
//	DW_AT_type:
	.4byte 0x00000c06
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x2f
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x3d3
//	DW_AT_type:
	.4byte 0x00000c0f
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x30
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x3e2
//	DW_AT_type:
	.4byte 0x00000c18
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x31
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x3ec
//	DW_AT_type:
	.4byte 0x00000c28
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x32
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x3f6
//	DW_AT_type:
	.4byte 0x00000c31
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x33
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x40e
//	DW_AT_type:
	.4byte 0x00000c3a
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x34
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x426
//	DW_AT_type:
	.4byte 0x00000c4a
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x35
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x43d
//	DW_AT_type:
	.4byte 0x00000c5a
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x36
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x447
//	DW_AT_type:
	.4byte 0x00000c6a
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x30
//	DW_AT_type:
	.4byte 0x00000af0
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x31
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x30
//	DW_AT_type:
	.4byte 0x00000acb
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x31
//	DW_AT_upper_bound:
	.byte 0x1f
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x30
//	DW_AT_type:
	.4byte 0x00000c21
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x31
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x29
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x3dc
//	DW_TAG_array_type:
	.byte 0x30
//	DW_AT_type:
	.4byte 0x000000a5
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x31
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x30
//	DW_AT_type:
	.4byte 0x00000af0
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x31
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x30
//	DW_AT_type:
	.4byte 0x00000c43
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x31
//	DW_AT_upper_bound:
	.byte 0x1f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x29
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x400
//	DW_TAG_array_type:
	.byte 0x30
//	DW_AT_type:
	.4byte 0x00000c53
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x31
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x29
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x417
//	DW_TAG_array_type:
	.byte 0x30
//	DW_AT_type:
	.4byte 0x00000c63
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x31
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x29
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x430
//	DW_TAG_array_type:
	.byte 0x30
//	DW_AT_type:
	.4byte 0x00000add
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x31
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x28
//	DW_AT_type:
	.4byte 0x00000c78
//	DW_TAG_typedef:
	.byte 0x2a
//	DW_AT_decl_line:
	.byte 0x37
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x3b3
//	DW_AT_type:
	.4byte 0x00000b7f
//	DW_TAG_subprogram:
	.byte 0x16
//	DW_AT_decl_line:
	.byte 0xe0
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000afc
//	DW_AT_name:
	.4byte .debug_str+0x451
	.4byte .debug_str+0x45c
//	DW_AT_external:
	.byte 0x01
//	DW_AT_inline:
	.byte 0x03
//	DW_TAG_formal_parameter:
	.byte 0x06
//	DW_AT_type:
	.4byte 0x00000af7
//	DW_TAG_formal_parameter:
	.byte 0x06
//	DW_AT_type:
	.4byte 0x00000c78
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x32
//	DW_AT_decl_line:
	.2byte 0x010f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x4bd
	.4byte .debug_str+0x4c5
//	DW_AT_frame_base:
	.2byte 0x7702
	.byte 0x00
//	DW_AT_low_pc:
	.8byte ..L307
//	DW_AT_high_pc:
	.8byte ..LN_Z7initMicPfll.1167
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x1c
//	DW_AT_decl_line:
	.2byte 0x010f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000af7
//	DW_AT_name:
	.2byte 0x0041
//	DW_AT_location:
	.4byte 0x01a09103
//	DW_TAG_formal_parameter:
	.byte 0x1c
//	DW_AT_decl_line:
	.2byte 0x010f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000b66
//	DW_AT_name:
	.2byte 0x004e
//	DW_AT_location:
	.4byte 0x01a89103
//	DW_TAG_formal_parameter:
	.byte 0x1c
//	DW_AT_decl_line:
	.2byte 0x010f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000b66
//	DW_AT_name:
	.2byte 0x004d
//	DW_AT_location:
	.2byte 0x5101
//	DW_TAG_variable:
