	.section .text
.LNDBG_TX:
# mark_description "Intel(R) C Intel(R) 64 Compiler for applications running on Intel(R) MIC Architecture, Version 16.0.0.109 Bu";
# mark_description "ild 20150815";
# mark_description " -I.. -I../pngwriter/include -qoffload -S -g -O3 -opt-gather-scatter-unroll=8 -fopenmp -fimf-domain-exclusio";
# mark_description "n=8 -mkl -mavx -qopt-report=5 -qopt-report-phase=vec -qopt-report-file=stdout -opt-report-routine=simd";
	.file "mandelbrot.cpp"
	.text
..TXTST0:
.L_2__routine_start_main_0:
# -- Begin  main
	.text
# mark_begin;
# Threads 4
        .align    16,0x90
	.globl main
# --- main(int, char **)
main:
# parameter 1(argc): %edi
# parameter 2(argv): %rsi
..B1.1:                         # Preds ..B1.0 Latency 9
	.cfi_startproc
	.cfi_personality 0x3,__gxx_personality_v0
..___tag_value_main.2:
..L3:
                                                          #307.1
..LN0:
	.file   1 "mandelbrot.cpp"
	.loc    1  307  is_stmt 1
        pushq     %rbp                                          #307.1
	.cfi_def_cfa_offset 16
..LN1:
        movq      %rsp, %rbp                                    #307.1
	.cfi_def_cfa 6, 16
	.cfi_offset 6, -16
..LN2:
        andq      $-128, %rsp                                   #307.1
..LN3:
        subq      $128, %rsp                                    #307.1 c1
..LN4:
        xorl      %esi, %esi                                    #307.1 c1
..LN5:
        movl      $3, %edi                                      #307.1 c5

//	DW_TAG_variable:
	.byte 0x1f
//	DW_AT_decl_line:
	.byte 0xf0
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x690
//	DW_AT_type:
	.4byte 0x00001421
//	DW_TAG_variable:
	.byte 0x1f
//	DW_AT_decl_line:
	.byte 0xf1
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x695
//	DW_AT_type:
	.4byte 0x00001421
//	DW_TAG_variable:
	.byte 0x1f
//	DW_AT_decl_line:
	.byte 0xf2
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x69a
//	DW_AT_type:
	.4byte 0x00001421
//	DW_TAG_variable:
	.byte 0x1f
//	DW_AT_decl_line:
	.byte 0xf4
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x69f
//	DW_AT_type:
	.4byte 0x000013f6
//	DW_TAG_variable:
	.byte 0x1f
//	DW_AT_decl_line:
	.byte 0xf5
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x6a6
//	DW_AT_type:
	.4byte 0x000013f6
//	DW_TAG_variable:
	.byte 0x1f
//	DW_AT_decl_line:
	.byte 0xf6
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x6ac
//	DW_AT_type:
	.4byte 0x000013f6
	.byte 0x00
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x27
//	DW_AT_decl_line:
	.2byte 0x0132
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000393
//	DW_AT_name:
	.4byte .debug_str+0x1b6
	.4byte .debug_str+0x1b6
//	DW_AT_low_pc:
	.8byte ..L3
//	DW_AT_high_pc:
	.8byte ..LNmain.20
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x28
//	DW_AT_decl_line:
	.2byte 0x0132
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000393
//	DW_AT_name:
	.4byte .debug_str+0x1bb
//	DW_AT_location:
	.2byte 0x5501
//	DW_TAG_formal_parameter:
	.byte 0x28
//	DW_AT_decl_line:
	.2byte 0x0132
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000134f
//	DW_AT_name:
	.4byte .debug_str+0x1c5
//	DW_AT_location:
	.2byte 0x5401
//	DW_TAG_variable:
	.byte 0x29
//	DW_AT_decl_line:
	.2byte 0x0135
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x004e
//	DW_AT_type:
	.4byte 0x0000137e
//	DW_TAG_variable:
	.byte 0x29
//	DW_AT_decl_line:
	.2byte 0x0135
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x004d
//	DW_AT_type:
	.4byte 0x0000137e
//	DW_TAG_variable:
	.byte 0x2a
//	DW_AT_decl_line:
	.2byte 0x0139
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1e5
//	DW_AT_type:
	.4byte 0x0000137e
//	DW_TAG_variable:
	.byte 0x29
//	DW_AT_decl_line:
	.2byte 0x013a
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0041
//	DW_AT_type:
	.4byte 0x00001360
//	DW_TAG_variable:
	.byte 0x2a
//	DW_AT_decl_line:
	.2byte 0x013d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1ee
//	DW_AT_type:
	.4byte 0x00001360
//	DW_TAG_variable:
	.byte 0x29
//	DW_AT_decl_line:
	.2byte 0x0141
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x6974
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00001385
//	DW_TAG_variable:
	.byte 0x2a
//	DW_AT_decl_line:
	.2byte 0x0148
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1fb
//	DW_AT_type:
	.4byte 0x00000393
//	DW_TAG_variable:
	.byte 0x29
//	DW_AT_decl_line:
	.2byte 0x014a
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x3074
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00001385
//	DW_TAG_variable:
	.byte 0x29
//	DW_AT_decl_line:
	.2byte 0x0150
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x3174
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00001385
//	DW_TAG_variable:
	.byte 0x29
//	DW_AT_decl_line:
	.2byte 0x0156
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x3274
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00001385
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x2b
//	DW_AT_type:
	.4byte 0x00001354
//	DW_TAG_pointer_type:
	.byte 0x2b
//	DW_AT_type:
	.4byte 0x00001359
//	DW_TAG_base_type:
	.byte 0x2c
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x1c0
//	DW_TAG_pointer_type:
	.byte 0x2b
//	DW_AT_type:
	.4byte 0x00001365
//	DW_TAG_base_type:
	.byte 0x2c
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x1ca
//	DW_TAG_base_type:
	.byte 0x2c
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x1d0
//	DW_TAG_typedef:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x2c
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x1de
//	DW_AT_type:
	.4byte 0x0000136c
//	DW_TAG_base_type:
	.byte 0x2c
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x1d9
//	DW_TAG_base_type:
	.byte 0x2c
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x1f4
//	DW_TAG_pointer_type:
	.byte 0x2b
//	DW_AT_type:
	.4byte 0x00001360
//	DW_TAG_base_type:
	.byte 0x2c
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0x405
//	DW_TAG_base_type:
	.byte 0x2c
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_encoding:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0x41c
//	DW_TAG_const_type:
	.byte 0x2d
//	DW_AT_type:
	.4byte 0x00001365
//	DW_TAG_const_type:
	.byte 0x2d
//	DW_AT_type:
	.4byte 0x0000137e
//	DW_TAG_pointer_type:
	.byte 0x2b
//	DW_AT_type:
	.4byte 0x00001360
//	DW_TAG_const_type:
	.byte 0x2d
//	DW_AT_type:
	.4byte 0x00000393
//	DW_TAG_pointer_type:
	.byte 0x2b
//	DW_AT_type:
	.4byte 0x00000393
//	DW_TAG_base_type:
	.byte 0x2c
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x512
//	DW_TAG_pointer_type:
	.byte 0x2b
//	DW_AT_type:
	.4byte 0x000013c4
//	DW_TAG_base_type:
	.byte 0x2c
//	DW_AT_byte_size:
	.byte 0x00
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x624
//	DW_TAG_typedef:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x48
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x631
//	DW_AT_type:
	.4byte 0x000013d6
//	DW_TAG_union_type:
	.byte 0x2e
//	DW_AT_decl_line:
	.byte 0x46
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0x40
//	DW_AT_name:
	.4byte .debug_str+0x631
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x47
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x639
//	DW_AT_type:
	.4byte 0x000013ed
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x30
//	DW_AT_type:
	.4byte 0x00000393
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x31
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x40
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x64a
//	DW_AT_type:
	.4byte 0x00001401
//	DW_TAG_union_type:
	.byte 0x2e
//	DW_AT_decl_line:
	.byte 0x3e
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0x40
//	DW_AT_name:
	.4byte .debug_str+0x64a
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x3f
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x651
//	DW_AT_type:
	.4byte 0x00001418
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x30
//	DW_AT_type:
	.4byte 0x00001365
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x31
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x29
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x66b
//	DW_AT_type:
	.4byte 0x0000142c
//	DW_TAG_base_type:
	.byte 0x2c
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x675
//	DW_TAG_typedef:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x20
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x711
//	DW_AT_type:
	.4byte 0x00000393
//	DW_TAG_base_type:
	.byte 0x2c
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x74c
//	DW_TAG_pointer_type:
	.byte 0x2b
//	DW_AT_type:
	.4byte 0x00000044
//	DW_TAG_typedef:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x6a
//	DW_AT_decl_file:
	.byte 0x09
//	DW_AT_name:
	.4byte .debug_str+0x7de
//	DW_AT_type:
	.4byte 0x00001455
//	DW_TAG_typedef:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x5f
//	DW_AT_decl_file:
	.byte 0x09
//	DW_AT_name:
	.4byte .debug_str+0x7e8
//	DW_AT_type:
	.4byte 0x00001460
//	DW_TAG_structure_type:
	.byte 0x32
//	DW_AT_decl_line:
	.byte 0x54
//	DW_AT_decl_file:
	.byte 0x09
//	DW_AT_byte_size:
	.byte 0x08
//	DW_TAG_union_type:
	.byte 0x33
//	DW_AT_decl_line:
	.byte 0x57
//	DW_AT_decl_file:
	.byte 0x09
//	DW_AT_byte_size:
	.byte 0x04
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x59
//	DW_AT_decl_file:
	.byte 0x09
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x7f4
//	DW_AT_type:
	.4byte 0x000013b8
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x5d
//	DW_AT_decl_file:
	.byte 0x09
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x7fa
//	DW_AT_type:
	.4byte 0x000014a2
	.byte 0x00
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x55
//	DW_AT_decl_file:
	.byte 0x09
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x801
//	DW_AT_type:
	.4byte 0x00000393
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x5e
//	DW_AT_decl_file:
	.byte 0x09
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x809
//	DW_AT_type:
	.4byte 0x00001464
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x30
//	DW_AT_type:
	.4byte 0x00001359
//	DW_AT_byte_size:
	.byte 0x04
//	DW_TAG_subrange_type:
	.byte 0x31
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x6d
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x811
//	DW_AT_type:
	.4byte 0x000013b8
//	DW_TAG_structure_type:
	.byte 0x34
//	DW_AT_decl_line:
	.byte 0x36
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_byte_size:
	.byte 0x60
//	DW_AT_name:
	.4byte .debug_str+0x818
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x3a
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x81e
//	DW_AT_type:
	.4byte 0x00001354
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x3b
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x82c
//	DW_AT_type:
	.4byte 0x00001354
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x41
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x83a
//	DW_AT_type:
	.4byte 0x00001354
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x47
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x843
//	DW_AT_type:
	.4byte 0x00001354
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x48
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0x853
//	DW_AT_type:
	.4byte 0x00001354
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x49
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x28
//	DW_AT_name:
	.4byte .debug_str+0x863
//	DW_AT_type:
	.4byte 0x00001354
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x4a
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x30
//	DW_AT_name:
	.4byte .debug_str+0x875
//	DW_AT_type:
	.4byte 0x00001354
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x4b
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x38
//	DW_AT_name:
	.4byte .debug_str+0x887
//	DW_AT_type:
	.4byte 0x00001354
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x4c
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x40
//	DW_AT_name:
	.4byte .debug_str+0x894
//	DW_AT_type:
	.4byte 0x00001354
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x4d
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x48
//	DW_AT_name:
	.4byte .debug_str+0x8a2
//	DW_AT_type:
	.4byte 0x00001354
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x4e
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x50
//	DW_AT_name:
	.4byte .debug_str+0x8b0
//	DW_AT_type:
	.4byte 0x00001359
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x4f
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x51
//	DW_AT_name:
	.4byte .debug_str+0x8b4
//	DW_AT_type:
	.4byte 0x00001359
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x51
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x52
//	DW_AT_name:
	.4byte .debug_str+0x8c0
//	DW_AT_type:
	.4byte 0x00001359
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x53
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x53
//	DW_AT_name:
	.4byte .debug_str+0x8ce
//	DW_AT_type:
	.4byte 0x00001359
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x55
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x54
//	DW_AT_name:
	.4byte .debug_str+0x8dd
//	DW_AT_type:
	.4byte 0x00001359
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x57
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x55
//	DW_AT_name:
	.4byte .debug_str+0x8eb
//	DW_AT_type:
	.4byte 0x00001359
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x5e
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x56
//	DW_AT_name:
	.4byte .debug_str+0x8fa
//	DW_AT_type:
	.4byte 0x00001359
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x5f
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x57
//	DW_AT_name:
	.4byte .debug_str+0x906
//	DW_AT_type:
	.4byte 0x00001359
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x62
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x58
//	DW_AT_name:
	.4byte .debug_str+0x912
//	DW_AT_type:
	.4byte 0x00001359
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x64
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x59
//	DW_AT_name:
	.4byte .debug_str+0x924
//	DW_AT_type:
	.4byte 0x00001359
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x66
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x5a
//	DW_AT_name:
	.4byte .debug_str+0x937
//	DW_AT_type:
	.4byte 0x00001359
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x68
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x5b
//	DW_AT_name:
	.4byte .debug_str+0x949
//	DW_AT_type:
	.4byte 0x00001359
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x6f
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x5c
//	DW_AT_name:
	.4byte .debug_str+0x95c
//	DW_AT_type:
	.4byte 0x00001359
//	DW_TAG_member:
	.byte 0x2f
//	DW_AT_decl_line:
	.byte 0x70
//	DW_AT_decl_file:
	.byte 0x0a
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x5d
//	DW_AT_name:
	.4byte .debug_str+0x96c
//	DW_AT_type:
	.4byte 0x00001359
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0xbb
//	DW_AT_decl_file:
	.byte 0x0b
//	DW_AT_name:
	.4byte .debug_str+0x97c
//	DW_AT_type:
	.4byte 0x0000161a
//	DW_TAG_pointer_type:
	.byte 0x2b
//	DW_AT_type:
	.4byte 0x0000161f
//	DW_TAG_const_type:
	.byte 0x2d
//	DW_AT_type:
	.4byte 0x00001624
//	DW_TAG_typedef:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x29
//	DW_AT_decl_file:
	.byte 0x0c
//	DW_AT_name:
	.4byte .debug_str+0x986
//	DW_AT_type:
	.4byte 0x0000162f
//	DW_TAG_base_type:
	.byte 0x2c
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x514
//	DW_TAG_typedef:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x35
//	DW_AT_decl_file:
	.byte 0x0b
//	DW_AT_name:
	.4byte .debug_str+0x990
//	DW_AT_type:
	.4byte 0x0000136c
	.byte 0x00
// -- Begin DWARF2 SEGMENT .debug_line
	.section .debug_line
.debug_line_seg:
	.align 1
// -- Begin DWARF2 SEGMENT .debug_abbrev
	.section .debug_abbrev
.debug_abbrev_seg:
	.align 1
	.byte 0x01
	.byte 0x11
	.byte 0x01
	.byte 0x1b
	.byte 0x0e
	.byte 0x03
	.byte 0x0e
	.byte 0x25
	.byte 0x0e
	.2byte 0x7681
	.byte 0x0e
	.byte 0x13
	.byte 0x0b
	.byte 0x53
	.byte 0x0c
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x01
	.byte 0x10
	.byte 0x06
	.2byte 0x0000
	.byte 0x02
	.byte 0x39
	.byte 0x01
	.byte 0x03
	.byte 0x08
	.2byte 0x0000
	.byte 0x03
	.byte 0x39
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x04
	.byte 0x02
	.byte 0x01
	.byte 0x3c
	.byte 0x0c
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x05
	.byte 0x02
	.byte 0x01
	.byte 0x3b
	.byte 0x05
	.byte 0x3a
	.byte 0x0b
	.byte 0x32
	.byte 0x0b
	.byte 0x0b
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x06
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x05
	.byte 0x3a
	.byte 0x0b
	.byte 0x3c
	.byte 0x0c
	.byte 0x3f
	.byte 0x0c
	.byte 0x03
	.byte 0x0e
	.2byte 0x4087
	.byte 0x0e
	.byte 0x49
	.byte 0x13
	.2byte 0x0000
	.byte 0x07
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x05
	.byte 0x3a
	.byte 0x0b
	.byte 0x3c
	.byte 0x0c
	.2byte 0x4087
	.byte 0x0e
	.byte 0x32
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.byte 0x3f
	.byte 0x0c
	.2byte 0x0000
	.byte 0x08
	.byte 0x05
	.byte 0x00
	.byte 0x49
	.byte 0x13
	.byte 0x34
	.byte 0x0c
	.2byte 0x0000
	.byte 0x09
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x3c
	.byte 0x0c
	.byte 0x3f
	.byte 0x0c
	.byte 0x03
	.byte 0x0e
	.2byte 0x4087
	.byte 0x0e
	.byte 0x49
	.byte 0x13
	.2byte 0x0000
	.byte 0x0a
	.byte 0x08
	.byte 0x00
	.byte 0x18
	.byte 0x13
	.2byte 0x0000
	.byte 0x0b
	.byte 0x16
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.byte 0x49
	.byte 0x13
	.2byte 0x0000
	.byte 0x0c
	.byte 0x39
	.byte 0x01
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x0d
	.byte 0x39
	.byte 0x00
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x0e
	.byte 0x2e
	.byte 0x01
	.byte 0x47
	.byte 0x13
	.byte 0x40
	.byte 0x0a
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x01
	.byte 0x3f
	.byte 0x0c
	.2byte 0x0000
	.byte 0x0f
	.byte 0x05
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x49
	.byte 0x13
	.byte 0x03
	.byte 0x0e
	.byte 0x02
	.byte 0x0a
	.2byte 0x0000
	.byte 0x10
	.byte 0x05
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x49
	.byte 0x13
	.byte 0x03
	.byte 0x08
	.byte 0x02
	.byte 0x0a
	.2byte 0x0000
	.byte 0x11
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x08
	.byte 0x49
	.byte 0x13
	.byte 0x02
	.byte 0x0a
	.2byte 0x0000
	.byte 0x12
	.byte 0x0b
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.2byte 0x0000
	.byte 0x13
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x08
	.byte 0x49
	.byte 0x13
	.2byte 0x0000
	.byte 0x14
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
