	.section .text
.LNDBG_TX:
# mark_description "Intel(R) C Intel(R) 64 Compiler for applications running on Intel(R) 64, Version 16.0.0.109 Build 20150815";
# mark_description "-I.. -I../pngwriter/include -qoffload -S -g -O3 -opt-gather-scatter-unroll=8 -fopenmp -fimf-domain-exclusion";
# mark_description "=8 -mkl -mavx -qopt-report=5 -qopt-report-phase=vec -qopt-report-file=stdout -opt-report-routine=simd";
	.file "mandelbrot.cpp"
	.text
..TXTST0:
.L_2__routine_start_main_0:
# -- Begin  main
	.text
# mark_begin;
       .align    16,0x90
	.globl main
# --- main(int, char **)
main:
# parameter 1(argc): %edi
# parameter 2(argv): %rsi
..B1.1:                         # Preds ..B1.0
	.cfi_startproc
	.cfi_personality 0x3,__gxx_personality_v0
..___tag_value_main.2:
..L3:
                                                          #307.1
..LN0:
	.file   1 "mandelbrot.cpp"
	.loc    1  307  is_stmt 1
        pushq     %rbp                                          #307.1
	.cfi_def_cfa_offset 16
..LN1:
        movq      %rsp, %rbp                                    #307.1
	.cfi_def_cfa 6, 16
	.cfi_offset 6, -16
..LN2:
        andq      $-128, %rsp                                   #307.1
..LN3:
        pushq     %r12                                          #307.1
..LN4:
        pushq     %r13                                          #307.1
..LN5:
        pushq     %r14                                          #307.1
..LN6:

	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x44
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.2byte 0x6574
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00001821
	.byte 0x00
//	DW_TAG_inlined_subroutine:
	.byte 0x30
//	DW_AT_low_pc:
	.8byte ..LN23
//	DW_AT_high_pc:
	.8byte ..LN109
//	DW_AT_abstract_origin:
	.4byte 0x000002db
//	DW_AT_call_line:
	.2byte 0x0136
//	DW_AT_call_column:
	.byte 0x05
//	DW_AT_call_file:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x32
//	DW_AT_decl_line:
	.byte 0x47
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_type:
	.4byte 0x000002a3
//	DW_AT_name:
	.4byte .debug_str+0x1ac
//	DW_TAG_formal_parameter:
	.byte 0x32
//	DW_AT_decl_line:
	.byte 0x48
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_type:
	.4byte 0x000017eb
//	DW_AT_name:
	.4byte .debug_str+0x1b6
//	DW_TAG_formal_parameter:
	.byte 0x32
//	DW_AT_decl_line:
	.byte 0x49
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_type:
	.4byte 0x0000180e
//	DW_AT_name:
	.4byte .debug_str+0x286
//	DW_TAG_formal_parameter:
	.byte 0x32
//	DW_AT_decl_line:
	.byte 0x4a
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_type:
	.4byte 0x0000180e
//	DW_AT_name:
	.4byte .debug_str+0x290
//	DW_TAG_formal_parameter:
	.byte 0x1d
//	DW_AT_decl_line:
	.byte 0x4b
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_type:
	.4byte 0x0000185d
//	DW_AT_name:
	.2byte 0x004e
//	DW_TAG_formal_parameter:
	.byte 0x1d
//	DW_AT_decl_line:
	.byte 0x4c
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_type:
	.4byte 0x0000185d
//	DW_AT_name:
	.2byte 0x004d
//	DW_TAG_variable:
	.byte 0x1f
//	DW_AT_decl_line:
	.byte 0x56
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x29a
//	DW_AT_type:
	.4byte 0x000002a3
//	DW_AT_location:
	.2byte 0x5d01
//	DW_TAG_inlined_subroutine:
	.byte 0x35
//	DW_AT_low_pc:
	.8byte ..LN39
//	DW_AT_high_pc:
	.8byte ..LN44
//	DW_AT_abstract_origin:
	.4byte 0x0000113a
//	DW_AT_call_line:
	.byte 0x54
//	DW_AT_call_column:
	.byte 0x13
//	DW_AT_call_file:
	.byte 0x02
//	DW_TAG_formal_parameter:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0121
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00001862
//	DW_AT_name:
	.4byte .debug_str+0x2a7
	.byte 0x00
//	DW_TAG_inlined_subroutine:
	.byte 0x35
//	DW_AT_low_pc:
	.8byte ..LN47
//	DW_AT_high_pc:
	.8byte ..LN52
//	DW_AT_abstract_origin:
	.4byte 0x0000113a
//	DW_AT_call_line:
	.byte 0x55
//	DW_AT_call_column:
	.byte 0x13
//	DW_AT_call_file:
	.byte 0x02
//	DW_TAG_formal_parameter:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x0121
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00001862
//	DW_AT_name:
	.4byte .debug_str+0x2a7
	.byte 0x00
//	DW_TAG_inlined_subroutine:
	.byte 0x35
//	DW_AT_low_pc:
	.8byte ..LN55
//	DW_AT_high_pc:
	.8byte ..LN61
//	DW_AT_abstract_origin:
	.4byte 0x00001099
//	DW_AT_call_line:
	.byte 0x56
//	DW_AT_call_column:
	.byte 0x19
//	DW_AT_call_file:
	.byte 0x02
//	DW_TAG_formal_parameter:
	.byte 0x34
//	DW_AT_decl_line:
	.2byte 0x011c
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00001862
//	DW_AT_name:
	.4byte .debug_str+0x2a7
	.byte 0x00
	.byte 0x00
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x36
//	DW_AT_type:
	.4byte 0x000017f0
//	DW_TAG_pointer_type:
	.byte 0x36
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_TAG_base_type:
	.byte 0x37
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x1b1
//	DW_TAG_base_type:
	.byte 0x37
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x1bb
//	DW_TAG_typedef:
	.byte 0x38
//	DW_AT_decl_line:
	.byte 0x2c
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x1c9
//	DW_AT_type:
	.4byte 0x000017fc
//	DW_TAG_base_type:
	.byte 0x37
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x1c4
//	DW_TAG_pointer_type:
	.byte 0x36
//	DW_AT_type:
	.4byte 0x0000181a
//	DW_TAG_base_type:
	.byte 0x37
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x1d9
//	DW_TAG_base_type:
	.byte 0x37
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x1e5
//	DW_TAG_const_type:
	.byte 0x39
//	DW_AT_type:
	.4byte 0x0000180e
//	DW_TAG_pointer_type:
	.byte 0x36
//	DW_AT_type:
	.4byte 0x000002a3
//	DW_TAG_pointer_type:
	.byte 0x36
//	DW_AT_type:
	.4byte 0x00001837
//	DW_TAG_subroutine_type:
	.byte 0x3a
//	DW_TAG_formal_parameter:
	.byte 0x18
//	DW_AT_type:
	.4byte 0x00001815
//	DW_TAG_formal_parameter:
	.byte 0x18
//	DW_AT_type:
	.4byte 0x0000180e
//	DW_TAG_formal_parameter:
	.byte 0x18
//	DW_AT_type:
	.4byte 0x0000180e
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x36
//	DW_AT_type:
	.4byte 0x0000184d
//	DW_TAG_base_type:
	.byte 0x37
//	DW_AT_byte_size:
	.byte 0x00
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x22b
//	DW_TAG_array_type:
	.byte 0x3b
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_AT_byte_size:
	.byte 0x80
//	DW_TAG_subrange_type:
	.byte 0x3c
//	DW_AT_upper_bound:
	.byte 0x7f
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x36
//	DW_AT_type:
	.4byte 0x0000180e
//	DW_TAG_pointer_type:
	.byte 0x36
//	DW_AT_type:
	.4byte 0x00001867
//	DW_TAG_const_type:
	.byte 0x39
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_TAG_pointer_type:
	.byte 0x36
//	DW_AT_type:
	.4byte 0x00001815
//	DW_TAG_pointer_type:
	.byte 0x36
//	DW_AT_type:
	.4byte 0x00001815
//	DW_TAG_const_type:
	.byte 0x39
//	DW_AT_type:
	.4byte 0x000002a3
//	DW_TAG_const_type:
	.byte 0x39
//	DW_AT_type:
	.4byte 0x0000181a
//	DW_TAG_base_type:
	.byte 0x37
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x30a
//	DW_TAG_typedef:
	.byte 0x38
//	DW_AT_decl_line:
	.byte 0x48
//	DW_AT_decl_file:
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x423
//	DW_AT_type:
	.4byte 0x00001892
//	DW_TAG_union_type:
	.byte 0x3d
//	DW_AT_decl_line:
	.byte 0x46
//	DW_AT_decl_file:
	.byte 0x08
//	DW_AT_byte_size:
	.byte 0x40
//	DW_AT_name:
	.4byte .debug_str+0x423
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x47
//	DW_AT_decl_file:
	.byte 0x08
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x42b
//	DW_AT_type:
	.4byte 0x000018a9
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x3b
//	DW_AT_type:
	.4byte 0x000002a3
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x3c
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x38
//	DW_AT_decl_line:
	.byte 0x40
//	DW_AT_decl_file:
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x43c
//	DW_AT_type:
	.4byte 0x000018bd
//	DW_TAG_union_type:
	.byte 0x3d
//	DW_AT_decl_line:
	.byte 0x3e
//	DW_AT_decl_file:
	.byte 0x08
//	DW_AT_byte_size:
	.byte 0x40
//	DW_AT_name:
	.4byte .debug_str+0x43c
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x3f
//	DW_AT_decl_file:
	.byte 0x08
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x443
//	DW_AT_type:
	.4byte 0x000018d4
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x3b
//	DW_AT_type:
	.4byte 0x0000181a
//	DW_AT_byte_size:
	.byte 0x40
//	DW_TAG_subrange_type:
	.byte 0x3c
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x38
//	DW_AT_decl_line:
	.byte 0x29
//	DW_AT_decl_file:
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x45d
//	DW_AT_type:
	.4byte 0x000018e8
//	DW_TAG_base_type:
	.byte 0x37
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x467
//	DW_TAG_base_type:
	.byte 0x37
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0x555
//	DW_TAG_base_type:
	.byte 0x37
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_encoding:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0x563
//	DW_TAG_typedef:
	.byte 0x38
//	DW_AT_decl_line:
	.byte 0x20
//	DW_AT_decl_file:
	.byte 0x0b
//	DW_AT_name:
	.4byte .debug_str+0x660
//	DW_AT_type:
	.4byte 0x000002a3
//	DW_TAG_base_type:
	.byte 0x37
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x69b
//	DW_TAG_pointer_type:
	.byte 0x36
//	DW_AT_type:
	.4byte 0x00000044
//	DW_TAG_typedef:
	.byte 0x38
//	DW_AT_decl_line:
	.byte 0x23
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x72d
//	DW_AT_type:
	.4byte 0x0000180e
//	DW_TAG_typedef:
	.byte 0x38
//	DW_AT_decl_line:
	.byte 0x6a
//	DW_AT_decl_file:
	.byte 0x0c
//	DW_AT_name:
	.4byte .debug_str+0x737
//	DW_AT_type:
	.4byte 0x0000192a
//	DW_TAG_typedef:
	.byte 0x38
//	DW_AT_decl_line:
	.byte 0x5f
//	DW_AT_decl_file:
	.byte 0x0c
//	DW_AT_name:
	.4byte .debug_str+0x741
//	DW_AT_type:
	.4byte 0x00001935
//	DW_TAG_structure_type:
	.byte 0x3f
//	DW_AT_decl_line:
	.byte 0x54
//	DW_AT_decl_file:
	.byte 0x0c
//	DW_AT_byte_size:
	.byte 0x08
//	DW_TAG_union_type:
	.byte 0x40
//	DW_AT_decl_line:
	.byte 0x57
//	DW_AT_decl_file:
	.byte 0x0c
//	DW_AT_byte_size:
	.byte 0x04
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x59
//	DW_AT_decl_file:
	.byte 0x0c
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x74d
//	DW_AT_type:
	.4byte 0x00001880
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x5d
//	DW_AT_decl_file:
	.byte 0x0c
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x753
//	DW_AT_type:
	.4byte 0x00001977
	.byte 0x00
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x55
//	DW_AT_decl_file:
	.byte 0x0c
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x75a
//	DW_AT_type:
	.4byte 0x000002a3
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x5e
//	DW_AT_decl_file:
	.byte 0x0c
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x762
//	DW_AT_type:
	.4byte 0x00001939
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x3b
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_AT_byte_size:
	.byte 0x04
//	DW_TAG_subrange_type:
	.byte 0x3c
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x38
//	DW_AT_decl_line:
	.byte 0x6d
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x76a
//	DW_AT_type:
	.4byte 0x00001880
//	DW_TAG_structure_type:
	.byte 0x41
//	DW_AT_decl_line:
	.byte 0x36
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x60
//	DW_AT_name:
	.4byte .debug_str+0x771
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x3a
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x777
//	DW_AT_type:
	.4byte 0x000017f0
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x3b
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x785
//	DW_AT_type:
	.4byte 0x000017f0
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x41
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x793
//	DW_AT_type:
	.4byte 0x000017f0
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x47
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x79c
//	DW_AT_type:
	.4byte 0x000017f0
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x48
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0x7ac
//	DW_AT_type:
	.4byte 0x000017f0
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x49
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x28
//	DW_AT_name:
	.4byte .debug_str+0x7bc
//	DW_AT_type:
	.4byte 0x000017f0
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x4a
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x30
//	DW_AT_name:
	.4byte .debug_str+0x7ce
//	DW_AT_type:
	.4byte 0x000017f0
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x4b
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x38
//	DW_AT_name:
	.4byte .debug_str+0x7e0
//	DW_AT_type:
	.4byte 0x000017f0
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x4c
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x40
//	DW_AT_name:
	.4byte .debug_str+0x7ed
//	DW_AT_type:
	.4byte 0x000017f0
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x4d
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x48
//	DW_AT_name:
	.4byte .debug_str+0x7fb
//	DW_AT_type:
	.4byte 0x000017f0
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x4e
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x50
//	DW_AT_name:
	.4byte .debug_str+0x809
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x4f
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x51
//	DW_AT_name:
	.4byte .debug_str+0x80d
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x51
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x52
//	DW_AT_name:
	.4byte .debug_str+0x819
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x53
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x53
//	DW_AT_name:
	.4byte .debug_str+0x827
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x55
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x54
//	DW_AT_name:
	.4byte .debug_str+0x836
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x57
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x55
//	DW_AT_name:
	.4byte .debug_str+0x844
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x5e
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x56
//	DW_AT_name:
	.4byte .debug_str+0x853
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x5f
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x57
//	DW_AT_name:
	.4byte .debug_str+0x85f
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x62
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x58
//	DW_AT_name:
	.4byte .debug_str+0x86b
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x64
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x59
//	DW_AT_name:
	.4byte .debug_str+0x87d
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x66
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x5a
//	DW_AT_name:
	.4byte .debug_str+0x890
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x68
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x5b
//	DW_AT_name:
	.4byte .debug_str+0x8a2
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x6f
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x5c
//	DW_AT_name:
	.4byte .debug_str+0x8b5
//	DW_AT_type:
	.4byte 0x000017f5
//	DW_TAG_member:
	.byte 0x3e
//	DW_AT_decl_line:
	.byte 0x70
//	DW_AT_decl_file:
	.byte 0x0d
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x5d
//	DW_AT_name:
	.4byte .debug_str+0x8c5
//	DW_AT_type:
	.4byte 0x000017f5
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x38
//	DW_AT_decl_line:
	.byte 0xbb
//	DW_AT_decl_file:
	.byte 0x0e
//	DW_AT_name:
	.4byte .debug_str+0x8d5
//	DW_AT_type:
	.4byte 0x00001aef
//	DW_TAG_pointer_type:
	.byte 0x36
//	DW_AT_type:
	.4byte 0x00001af4
//	DW_TAG_const_type:
	.byte 0x39
//	DW_AT_type:
	.4byte 0x00001af9
//	DW_TAG_typedef:
	.byte 0x38
//	DW_AT_decl_line:
	.byte 0x29
//	DW_AT_decl_file:
	.byte 0x0f
//	DW_AT_name:
	.4byte .debug_str+0x8df
//	DW_AT_type:
	.4byte 0x00001b04
//	DW_TAG_base_type:
	.byte 0x37
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x30c
//	DW_TAG_typedef:
	.byte 0x38
//	DW_AT_decl_line:
	.byte 0x35
//	DW_AT_decl_file:
	.byte 0x0e
//	DW_AT_name:
	.4byte .debug_str+0x8e9
//	DW_AT_type:
	.4byte 0x000017fc
//	DW_TAG_variable:
	.byte 0x42
//	DW_AT_specification:
	.4byte 0x000000a0
//	DW_AT_location:
	.2byte 0x0309
	.8byte _ZSt8__ioinit
//	DW_TAG_variable:
	.byte 0x43
//	DW_AT_name:
	.4byte .debug_str+0x8f2
//	DW_AT_type:
	.4byte 0x00001848
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_external:
	.byte 0x01
	.byte 0x00
// -- Begin DWARF2 SEGMENT .debug_line
	.section .debug_line
.debug_line_seg:
	.align 1
// -- Begin DWARF2 SEGMENT .debug_abbrev
	.section .debug_abbrev
.debug_abbrev_seg:
	.align 1
	.byte 0x01
	.byte 0x11
	.byte 0x01
	.byte 0x1b
	.byte 0x0e
	.byte 0x03
	.byte 0x0e
	.byte 0x25
	.byte 0x0e
	.2byte 0x7681
	.byte 0x0e
	.byte 0x13
	.byte 0x0b
	.byte 0x53
	.byte 0x0c
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x01
	.byte 0x10
	.byte 0x06
	.2byte 0x0000
	.byte 0x02
	.byte 0x39
	.byte 0x01
	.byte 0x03
	.byte 0x08
	.2byte 0x0000
	.byte 0x03
	.byte 0x39
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x04
	.byte 0x02
	.byte 0x01
	.byte 0x3c
	.byte 0x0c
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x05
	.byte 0x02
	.byte 0x01
	.byte 0x3b
	.byte 0x05
	.byte 0x3a
	.byte 0x0b
	.byte 0x32
	.byte 0x0b
	.byte 0x0b
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x06
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x05
	.byte 0x3a
	.byte 0x0b
	.byte 0x3c
	.byte 0x0c
	.byte 0x3f
	.byte 0x0c
	.byte 0x03
	.byte 0x0e
	.2byte 0x4087
	.byte 0x0e
	.byte 0x49
	.byte 0x13
	.2byte 0x0000
	.byte 0x07
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x05
	.byte 0x3a
	.byte 0x0b
	.byte 0x3c
	.byte 0x0c
	.2byte 0x4087
	.byte 0x0e
	.byte 0x32
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.byte 0x3f
	.byte 0x0c
	.2byte 0x0000
	.byte 0x08
	.byte 0x05
	.byte 0x00
	.byte 0x49
	.byte 0x13
	.byte 0x34
	.byte 0x0c
	.2byte 0x0000
	.byte 0x09
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x3c
	.byte 0x0c
	.byte 0x3f
	.byte 0x0c
	.byte 0x03
	.byte 0x0e
	.2byte 0x4087
	.byte 0x0e
	.byte 0x49
	.byte 0x13
	.2byte 0x0000
	.byte 0x0a
	.byte 0x08
	.byte 0x00
	.byte 0x18
	.byte 0x13
	.2byte 0x0000
	.byte 0x0b
	.byte 0x39
	.byte 0x01
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x0c
	.byte 0x39
	.byte 0x00
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x0d
	.byte 0x2e
	.byte 0x01
	.byte 0x47
	.byte 0x13
	.byte 0x40
	.byte 0x0a
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x01
	.byte 0x3f
	.byte 0x0c
	.2byte 0x0000
	.byte 0x0e
	.byte 0x05
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x49
	.byte 0x13
	.byte 0x03
	.byte 0x0e
	.byte 0x02
	.byte 0x0a
	.2byte 0x0000
	.byte 0x0f
	.byte 0x05
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x49
	.byte 0x13
	.byte 0x03
	.byte 0x08
	.byte 0x02
	.byte 0x0a
	.2byte 0x0000
	.byte 0x10
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x08
	.byte 0x49
	.byte 0x13
	.byte 0x02
	.byte 0x0a
	.2byte 0x0000
	.byte 0x11
	.byte 0x0b
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.2byte 0x0000
	.byte 0x12
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
