	.section .text
.LNDBG_TX:
# mark_description "Intel(R) C Intel(R) 64 Compiler for applications running on Intel(R) 64, Version 16.0.0.109 Build 20150815";
# mark_description "-I.. -S -g -O3 -fopenmp -fma -march=core-avx2 -qopt-report=5 -qopt-report-phase=vec -qopt-report-file=stdout";
# mark_description " -opt-report-routine=simd";
	.file "intrin.cpp"
	.text
..TXTST0:
.L_2__routine_start__Z9intrinsicPfll_0:
# -- Begin  _Z9intrinsicPfll, L__Z9intrinsicPfll_34__par_loop0_2.0
	.text
# mark_begin;
       .align    16,0x90
	.globl _Z9intrinsicPfll
# --- intrinsic(float *, long, long)
_Z9intrinsicPfll:
# parameter 1(A): %rdi
# parameter 2(N): %rsi
# parameter 3(M): %rdx
..B1.1:                         # Preds ..B1.0
	.cfi_startproc
	.cfi_personality 0x3,__gxx_personality_v0
..___tag_value__Z9intrinsicPfll.2:
..L3:
                                                          #14.1
..LN0:
	.file   1 "intrin.cpp"
	.loc    1  14  is_stmt 1
        pushq     %rbp                                          #14.1
	.cfi_def_cfa_offset 16
..LN1:
        movq      %rsp, %rbp                                    #14.1
	.cfi_def_cfa 6, 16
	.cfi_offset 6, -16
..LN2:
        andq      $-32, %rsp                                    #14.1
..LN3:
        subq      $416, %rsp                                    #14.1
..LN4:
	.loc    1  22  prologue_end  is_stmt 1
        lea       7(%rsi), %rax                                 #22.23
..LN5:

//	DW_AT_decl_line:
	.byte 0x1b
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1b1
//	DW_AT_type:
	.4byte 0x000003f5
//	DW_AT_location:
	.4byte 0x06207603
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x1d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1bb
//	DW_AT_type:
	.4byte 0x000003f5
//	DW_AT_location:
	.4byte 0x06287603
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x1c
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1b6
//	DW_AT_type:
	.4byte 0x000003f5
//	DW_AT_location:
	.4byte 0x06307603
//	DW_TAG_variable:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x22
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x004e
//	DW_AT_type:
	.4byte 0x000003be
//	DW_AT_location:
	.4byte 0x06387603
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x10
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x170
//	DW_AT_type:
	.4byte 0x000003ca
//	DW_AT_location:
	.4byte 0x00c07604
	.byte 0x06
//	DW_TAG_variable:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x23
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x000003cf
//	DW_AT_location:
	.2byte 0x5001
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x26
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1c5
//	DW_AT_type:
	.4byte 0x000003b7
//	DW_AT_location:
	.4byte 0x02a89103
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x27
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1cc
//	DW_AT_type:
	.4byte 0x000003f5
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x29
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1d1
//	DW_AT_type:
	.4byte 0x000003f5
//	DW_TAG_variable:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0x2b
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x000003cf
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x2c
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1d6
//	DW_AT_type:
	.4byte 0x000003f5
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x2e
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1db
//	DW_AT_type:
	.4byte 0x000003f5
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x30
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1e0
//	DW_AT_type:
	.4byte 0x000003f5
//	DW_AT_location:
	.2byte 0x6301
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x31
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1e6
//	DW_AT_type:
	.4byte 0x000003f5
//	DW_AT_location:
	.2byte 0x6401
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x31
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1ec
//	DW_AT_type:
	.4byte 0x000003f5
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x32
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1f2
//	DW_AT_type:
	.4byte 0x00000429
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x33
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x17a
//	DW_AT_type:
	.4byte 0x000003cf
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x35
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x2a7
//	DW_AT_type:
	.4byte 0x000003f5
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x36
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x2ad
//	DW_AT_type:
	.4byte 0x000003f5
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x37
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x2b3
//	DW_AT_type:
	.4byte 0x000003f5
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x4c
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x204
//	DW_AT_type:
	.4byte 0x00000430
//	DW_AT_location:
	.4byte 0x03809103
//	DW_TAG_variable:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x4e
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x00706f74
//	DW_AT_type:
	.4byte 0x000003cf
//	DW_AT_location:
	.2byte 0x5001
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x4f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x2a1
//	DW_AT_type:
	.4byte 0x000003ca
//	DW_TAG_variable:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0x50
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006b
//	DW_AT_type:
	.4byte 0x000003cf
	.byte 0x00
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x000003b7
//	DW_TAG_base_type:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x157
//	DW_TAG_const_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x000003c3
//	DW_TAG_base_type:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x15d
//	DW_TAG_pointer_type:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x000003cf
//	DW_TAG_base_type:
	.byte 0x0f
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte 0x00746e69
//	DW_TAG_base_type:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x162
//	DW_TAG_pointer_type:
	.byte 0x0c
//	DW_AT_type:
	.4byte 0x000003e2
//	DW_TAG_const_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x000003b7
//	DW_TAG_const_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x000003cf
//	DW_TAG_array_type:
	.byte 0x10
//	DW_AT_type:
	.4byte 0x000003b7
//	DW_AT_byte_size:
	.byte 0x18
//	DW_TAG_subrange_type:
	.byte 0x11
//	DW_AT_upper_bound:
	.byte 0x05
	.byte 0x00
//	DW_TAG_typedef:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x21
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x197
//	DW_AT_type:
	.4byte 0x00000400
//	DW_TAG_union_type:
	.byte 0x13
//	DW_AT_decl_line:
	.byte 0x1f
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_byte_size:
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0x197
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x20
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x19e
//	DW_AT_type:
	.4byte 0x00000417
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x10
//	DW_AT_type:
	.4byte 0x000003b7
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x11
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x10
//	DW_AT_type:
	.4byte 0x000003b7
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x11
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x1f7
//	DW_TAG_typedef:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x37
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x20b
//	DW_AT_type:
	.4byte 0x0000043b
//	DW_TAG_union_type:
	.byte 0x13
//	DW_AT_decl_line:
	.byte 0x27
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_byte_size:
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0x20b
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x2d
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x213
//	DW_AT_type:
	.4byte 0x000004c2
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x2f
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x230
//	DW_AT_type:
	.4byte 0x000004cb
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x30
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x23f
//	DW_AT_type:
	.4byte 0x000004db
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x31
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x249
//	DW_AT_type:
	.4byte 0x000004eb
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x32
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x253
//	DW_AT_type:
	.4byte 0x000004f4
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x33
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x26b
//	DW_AT_type:
	.4byte 0x000004fd
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x34
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x283
//	DW_AT_type:
	.4byte 0x0000050d
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x35
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x28d
//	DW_AT_type:
	.4byte 0x0000051d
//	DW_TAG_member:
	.byte 0x14
//	DW_AT_decl_line:
	.byte 0x36
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x297
//	DW_AT_type:
	.4byte 0x00000526
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x10
//	DW_AT_type:
	.4byte 0x000003c3
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x11
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x10
//	DW_AT_type:
	.4byte 0x000004d4
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x11
//	DW_AT_upper_bound:
	.byte 0x1f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x22b
//	DW_TAG_array_type:
	.byte 0x10
//	DW_AT_type:
	.4byte 0x000004e4
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x11
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x239
//	DW_TAG_array_type:
	.byte 0x10
//	DW_AT_type:
	.4byte 0x000003cf
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x11
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x10
//	DW_AT_type:
	.4byte 0x000003c3
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x11
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x10
//	DW_AT_type:
	.4byte 0x00000506
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x11
//	DW_AT_upper_bound:
	.byte 0x1f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x25d
//	DW_TAG_array_type:
	.byte 0x10
//	DW_AT_type:
	.4byte 0x00000516
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x11
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0d
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x274
//	DW_TAG_array_type:
	.byte 0x10
//	DW_AT_type:
	.4byte 0x00000429
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x11
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x10
//	DW_AT_type:
	.4byte 0x000003d6
//	DW_AT_byte_size:
	.byte 0x20
//	DW_TAG_subrange_type:
	.byte 0x11
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
	.byte 0x00
// -- Begin DWARF2 SEGMENT .debug_line
	.section .debug_line
.debug_line_seg:
	.align 1
// -- Begin DWARF2 SEGMENT .debug_abbrev
	.section .debug_abbrev
.debug_abbrev_seg:
	.align 1
	.byte 0x01
	.byte 0x11
	.byte 0x01
	.byte 0x1b
	.byte 0x0e
	.byte 0x03
	.byte 0x0e
	.byte 0x25
	.byte 0x0e
	.2byte 0x7681
	.byte 0x0e
	.byte 0x13
	.byte 0x0b
	.byte 0x53
	.byte 0x0c
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x01
	.byte 0x10
	.byte 0x06
	.2byte 0x0000
	.byte 0x02
	.byte 0x39
	.byte 0x00
	.byte 0x03
	.byte 0x08
	.2byte 0x0000
	.byte 0x03
	.byte 0x39
	.byte 0x00
	.byte 0x03
	.byte 0x0e
	.2byte 0x0000
	.byte 0x04
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.2byte 0x4087
	.byte 0x0e
	.byte 0x40
	.byte 0x0a
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x01
	.byte 0x3f
	.byte 0x0c
	.2byte 0x0000
	.byte 0x05
	.byte 0x05
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x49
	.byte 0x13
	.byte 0x03
	.byte 0x08
	.byte 0x02
	.byte 0x0a
	.2byte 0x0000
	.byte 0x06
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.byte 0x49
	.byte 0x13
	.byte 0x02
	.byte 0x0a
	.2byte 0x0000
	.byte 0x07
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.byte 0x49
	.byte 0x13
	.2byte 0x0000
	.byte 0x08
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x08
	.byte 0x49
	.byte 0x13
	.2byte 0x0000
	.byte 0x09
	.byte 0x0b
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.2byte 0x0000
	.byte 0x0a
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
